{
  "title": "Not Loving Every Day of Work? Here’s Why That’s Completely Normal",
  "url": "https://medium.com/@kenji-onisuka/not-loving-every-day-of-work-heres-why-that-s-completely-normal-e870231abebd",
  "author": "Kenji",
  "publish_date": "Sep 28, 2024",
  "read_time": "2 min read",
  "claps": 67,
  "comments": 0,
  "content": "Not Loving Every Day of Work? Here’s Why That’s Completely Normal\n\nHow Embracing Challenges and Setbacks Can Lead to Greater Success and Fulfillment\n\nKenji\n\n67\n\nHappiness isn’t constant, and that’s okay. Life’s ups and downs shape us. Success isn’t about daily joy — it’s about resilience through the hard times.\n\nHappiness isn’t constant, and that’s okay. Life’s ups and downs shape us. Success isn’t about daily joy — it’s about resilience through the hard times.\n\nI used to believe that finding my passion meant loving my job every day. But I’ve learned that passion is more than daily happiness — it’s about staying committed to a bigger purpose and pushing through challenges.\n\nPassion Isn’t Constant Joy\n\nI enjoy my work for three reasons: it satisfies my curiosity, I’m quite good at it, and I get paid for it. But I don’t love every day of my job. Some days are stressful or frustrating, and that’s normal. What truly drives me is the larger mission and the impact of my work, not fleeting moments of happiness.\n\nThis realization hit home when I listened to Jensen Huang, CEO of NVIDIA, in one of his interviews. He’s led the company for over 30 years, but even he admits that not every day is joyful. While developing CUDA — a technology that took years to pay off — Huang faced immense challenges and moments of doubt. Yet, he remained focused on the bigger picture. His story is a powerful reminder that even when we’re passionate about our work, tough days are inevitable.\n\nThe Inevitable Challenges\n\nEveryone faces challenges, whether in career, finances, or personal life. I’ve had my own share of tough periods. At one point, I worked in a high-paying job, and for a while, I enjoyed it. But over time, I stopped believing in the work I was doing. I thought the financial reward would bring me happiness, but it didn’t. Eventually, I left for something more fulfilling, even though it meant earning less. That decision taught me an important lesson: passion demands resilience. It’s about pushing through adversity because you believe in your work and its larger purpose.\n\nBelieving in the Bigger Picture\n\nFor me, switching to a more meaningful career brought deeper satisfaction, even with financial sacrifices. It’s this belief in the bigger picture that fuels passion and keeps you moving forward, just as Huang stayed committed to his vision despite setbacks.\n\nPassion isn’t about feeling fulfilled every single day — it’s about trusting in the purpose behind your work and knowing that even the tough days contribute to something meaningful.\n\nPassion isn’t about feeling fulfilled every single day — it’s about trusting in the purpose behind your work and knowing that even the tough days contribute to something meaningful.",
  "scraped_at": "2025-04-07 08:25:21"
}