{
  "title": "2024 Podcast Playlist: 8 Essential Picks for Curious Minds",
  "url": "https://medium.com/@kenji-onisuka/2024-podcast-playlist-8-essential-picks-for-curious-minds-3a07bfd2bda8",
  "author": "Kenji",
  "publish_date": "Aug 20, 2024",
  "read_time": "5 min read",
  "claps": 0,
  "comments": 0,
  "content": "Member-only story\n\n2024 Podcast Playlist: 8 Essential Picks for Curious Minds\n\nDiscover the Podcasts That Will Keep You Informed, Inspired, and Entertained\n\nKenji\n\nI’ve increasingly turned to podcasts as a source of inspiration, knowledge, and entertainment. Whether I’m stuck in traffic, exercising at the gym, or unwinding at home, these audio gems have become my constant companions.\n\nI’m in a sharing mood today. So, I thought, why not share my current podcast rotation? It’s a mix that keeps me informed, challenges my perspectives, and often leaves me with more questions than answers — in the best way possible. I’ve ranked them based on a combination of factors: how often I tune in, their impact on my thinking, and the sheer enjoyment I get from each episode. Let me know if you agree with my ranking or if you’d shuffle the deck differently!\n\nModern Wisdom by Chris Williamson\n\nThis podcast tops my list for a good reason. Chris Williamson combines practical wisdom with forward-thinking ideas. One day, you’re exploring the latest productivity strategies or diving into discussions on emotion and mental health issues; the next, you’re examining the philosophical implications of emerging technologies. It’s like having a conversation with that well-informed friend who always leaves you feeling smarter and more inspired.\n\nLex Fridman Podcast\n\nA close second is Lex Fridman’s podcast. If you’re into deep explorations of technology, science, and philosophy, this is the podcast for you. Lex’s genuine curiosity is infectious. He has a way of making even the most complex topics accessible. Whether he’s chatting with AI pioneers or renowned philosophers, you feel like you’re part of a mind-expanding conversation. One of his latest episodes was over 8 hours long, where he spoke with Elon Musk (for the 5th time on his show) and the Neuralink team. I went hardcore 🎧, listening from beginning to end. 😊\n\nHard Fork by Kevin Roose and Casey Newton\n\nTo stay on top of the ever-changing tech landscape, Hard Fork is my go-to. This is one of the most entertaining podcasts, and yet very informative. 🎭Kevin Roose and Casey Newton have a great dynamic — their witty banter makes complex tech news digestible. It’s like having tech-savvy friends who keep you informed without making you feel out of your depth. 🤓 Their analysis of technology’s impact on society always leaves me with food for thought. 💡\n\nPivot by Scott Galloway and Kara Swisher\n\nPivot offers candid commentary on tech, business, and politics. Scott Galloway and Kara Swisher are a dynamic duo with sharp analysis. Kara, a veteran tech journalist, brings incredible insight into Silicon Valley’s inner workings. Her recently published book, “Burn Book,” offers a scathing yet insightful look at the tech industry and its key players. Scott’s business acumen and Kara’s deep tech knowledge create a powerful combination. Their contrasting perspectives and undeniable chemistry make for engaging listening. If you’re interested in tech, business, and politics, you should check out this podcast.\n\nThe Ezra Klein Show\n\nEzra Klein’s show is my window into politics, policy, and big ideas. I appreciate how he approaches each topic with nuance and depth. His diverse guest list exposes me to new perspectives, and his thoughtful questioning often leads to lightbulb moments that make complex issues clearer.\n\nTraining Data by Sequoia Capital\n\nA relatively new addition to my playlist, Training Data has quickly become my favorite. It features discussions with leading AI builders and researchers, asking critical questions and developing a deep understanding of the technology. The hosts talk about complex topics with clarity and insight. One of my favorite episodes featured Klarna CEO Sebastian Siemiatkowski, who discussed how AI is doing the work of 700 customer service representatives. Another standout was the conversation with Meta’s Joe Spisak about Llama 3.1 405B and the democratization of frontier models. These episodes inform and inspire, offering a glimpse into the future of AI and its practical applications.\n\nThe TED AI Show\n\nWith AI being such a hot topic, The TED AI Show is a great way to stay informed about the latest developments. It explores not just the technology but also its potential societal impacts. It’s thought-provoking stuff that often leaves me pondering long after the episode ends.\n\nThe Joe Rogan Experience by Joe Rogan\n\nRounding out my list is The Joe Rogan Experience. Joe can be a polarizing figure, but though I appreciate his show for the sheer variety of guests and topics. It’s like a box of chocolates — you never know what you’re going to get. Sometimes it’s hilarious, sometimes profound, and sometimes controversial, but it always gets me thinking and often exposes me to perspectives outside my usual media bubble.\n\nThese podcasts have become more than just background noise. They’ve challenged my perspectives, sparked moments of reflection, and shaped how I see the world. From cutting-edge tech and AI to timeless philosophical questions, they offer a rich array of knowledge that keeps my mind engaged.\n\nWhy Should You Care?\n\nYou might wonder, “Why should I care about your podcast list?” Fair question. Here’s why it matters:\n\nIf you haven’t listened to some of these podcasts, why not give one or two a try? You might find your next favorite. And who knows? It could be the start of your own journey of discovery and growth.\n\nHappy listening, and here’s to expanding our minds in 2024 and beyond!",
  "scraped_at": "2025-04-07 08:15:45"
}