{
  "title": "5 Signs You’re Doing Better Than You Think (Even If It Doesn’t Feel Like It)",
  "url": "https://medium.com/@kenji-onisuka/5-signs-youre-doing-better-than-you-think-even-if-it-doesn-t-feel-like-it-89e99d2090b7",
  "author": "Kenji",
  "publish_date": "Dec 28, 2024",
  "read_time": "3 min read",
  "claps": 33,
  "comments": 0,
  "content": "Member-only story\n\n5 Signs You’re Doing Better Than You Think (Even If It Doesn’t Feel Like It)\n\nKenji\n\n33\n\nAs the year draws to a close, many of us, myself included, start reflecting on what we’ve achieved—or perhaps didn’t achieve. It’s natural to wonder if we’ve made enough progress in our careers, personal lives, and goals. But here’s the thing: we often judge ourselves too harshly, especially when we compare our journey to someone else’s. There’s a reason why people say, “Comparison is the thief of joy.”\n\nInstead of measuring yourself against others, take a moment to think through what you have done right—or even what didn’t go as planned but still kept you on your path. Progress isn’t always loud or flashy; sometimes, it’s subtle. And if you’re feeling down or thinking you haven’t accomplished enough, I encourage you to take a closer look. Below are five signs that you’re doing a lot better than you think.\n\n1. You’ve Found Time for Small Joys\n\nWhether it’s laughing over a TV show, enjoying a quiet moment with a book, or savoring your favorite meal, making space for what brings you happiness is no small accomplishment. These moments reflect balance. They mean you’re prioritizing your well-being—not just powering through life.\n\n2. You’re Not the Same Person You Were Last Year\n\nGrowth isn’t always loud. Sometimes it looks like learning from mistakes, identifying what truly matters, or simply recognizing what no longer serves you. If you’ve gained new insights or shifted your perspective, that’s meaningful progress. You’re evolving, even if it’s in ways that feel quiet.\n\n3. You’ve Taken Steps Beyond the Basics\n\nLife can feel overwhelming, but if you’ve managed to do anything that wasn’t strictly necessary—like attending an event, trying something new, or treating yourself—you’re doing better than you think. These small actions show you’ve created space for more than just getting by. That’s worth celebrating.\n\n4. You’ve Met Your Everyday Needs\n\nFrom keeping a roof over your head to handling life’s practicalities, meeting your day-to-day needs is an achievement we often overlook. It reflects your ability to manage, prioritize, and sustain yourself. This foundation allows you to build toward even bigger goals.\n\n5. You’re Working Toward Something\n\nWhether your dream is crystal clear or still taking shape, having a goal—even a small one—shows resilience. It means you’re not giving up on yourself. Progress might be slow, but the fact that you’re trying counts. The steps you’re taking today are shaping the future you want.\n\nCelebrate the Wins You Might Be Overlooking\n\nAs we approach the new year, give yourself credit for the progress you’ve made—no matter how small it seems. Maybe you didn’t achieve every goal you set, but that doesn’t mean the year was wasted. Progress is often quiet and happens in moments we don’t immediately recognize.\n\nHere’s to another year of growth, learning, and building the life you want. You’re doing better than you think. Trust yourself, keep moving forward, and stay hopeful for what’s ahead.",
  "scraped_at": "2025-04-07 08:15:57"
}