{
  "title": "Focusing on What Matters",
  "url": "https://medium.com/@kenji-onisuka/focusing-on-what-matters-3bac4369c5fd",
  "author": "Kenji",
  "publish_date": "Aug 9, 2024",
  "read_time": "4 min read",
  "claps": 0,
  "comments": 0,
  "content": "Focusing on What Matters\n\nAI, it’s everywhere, right?\n\nKenji\n\nFrom writing essays to creating art, it seems like there’s nothing this technology can’t do. As someone who’s been exploring how to integrate AI into my daily work, I’ve had my fair share of “wow” moments. But I’ve also realized something important: while trying out every cool AI feature we come across is tempting, that approach can quickly become a distraction.\n\nThink about it. How often have you found yourself playing with an AI tool, amazed at what it can do, only to realize an hour has passed and you haven’t accomplished anything? I’ve been there, and I bet many of you have too. It’s like being a kid in a candy store — everything looks exciting, but too much of it isn’t good for you.\n\nSo, what’s the smarter way to approach generative AI in business? Let’s break it down.\n\nStart Small, But Think Big\n\nThere’s nothing wrong with starting with a small proof of concept (POC). It’s like dipping your toe in the water before diving in. But here’s the catch — don’t get stuck in the shallow end. Once you’ve identified an area where it can genuinely impact your operations, it’s time to go all in.\n\nI recently heard about a telecom company that targeted an 80% productivity improvement in its customer call centers. That’s not just a small tweak; it’s a complete reimagining of how it operates. And guess what? It’s well on its way to achieving it.\n\nThe 4Cs of Generative AI\n\nAs I’ve explored this space, I’ve noticed four core areas where it is making waves — what McKinsey refers to as the 4Cs: Customer Journeys, Concision, Coding, and Creative Content.\n\nTaker, Shaper, or Maker?\n\nNow, here’s where it gets interesting. Once you’ve identified your AI sweet spot, you must decide how to approach it. Are you going to be a taker, a shaper, or a maker?\n\nThe Real Challenge\n\nHere’s the thing—the technology itself isn’t the biggest hurdle. The real challenge is how we integrate AI into our existing processes and, more importantly, how we prepare our people for this change.\n\nI was chatting with a friend who works at a major retail. They implemented an AI system to help with customer queries. The impressive system could handle complex questions. But you know what the biggest challenge was? Getting the human staff to trust and work alongside the AI.\n\nIt’s not just about the tech; it’s about the human side of the equation. How do we upskill our workforce? How do we ensure that AI enhances rather than replaces human creativity and decision-making?\n\nThe Road Ahead\n\nIt’s crucial to stay focused on what matters for your business. Don’t get caught up in the hype or try to do everything simultaneously. Instead, identify where AI can set you apart and focus on that area.\n\nRemember, generative AI is more than just a new tool — it’s a transformative force. Used wisely, it can unlock new levels of efficiency, creativity, and competitive advantage. But it requires thoughtful integration and a clear strategy.",
  "scraped_at": "2025-04-07 08:20:33"
}