{
  "title": "I Do This Every Morning to Feel Energized, Focused, and in Control",
  "url": "https://medium.com/@kenji-onisuka/i-do-this-every-morning-to-feel-energized-focused-and-in-control-aaad7bc221dd",
  "author": "Kenji",
  "publish_date": "Oct 25, 2024",
  "read_time": "2 min read",
  "claps": 22,
  "comments": 0,
  "content": "Member-only story\n\nI Do This Every Morning to Feel Energized, Focused, and in Control\n\nSmall morning habits create lasting change, helping you show up as the best version of yourself\n\nKenji\n\n22\n\nA\nbout five months ago, I realized my morning routine needed to reflect the person I wanted to become, not who I was at the time. I know I know — it might be a bit late to realize that, but at least I did. And since then, it has given me more energy, more focus, and even a sense of control back in my life.\n\nHere’s what I realized:\nEach morning is a chance to reset and take steps toward becoming the person I want to be. But my old routine wasn’t working — it didn’t align with the direction I wanted to go. I realized that if I didn’t change the way I started my mornings, I would stay stuck right where I was, missing out on the progress I wanted to make.\n\nSo, I made a shift:\n\nThis change wasn’t easy, but it’s been worth it. Prioritizing myself first thing in the morning gives me more control over my day. I start with intention, instead of reacting to emails or scrolling on my phone. I feel more focused and energized, and that sense of direction carries me through the rest of the day.\n\nThe best year of your life doesn’t just happen — it takes purposeful action and committed effort. It’s not about waiting for the right moment or motivation. It’s about showing up for yourself, even when it’s hard. And that starts the moment your alarm rings.\n\nWhen the alarm rings, get your ass out of bed immediately. No snoozing, no excuses. Hitting the snooze button is procrastination on your life. And for me, it definitely was.\n\nThe way you begin your day shapes everything that follows. Small wins — like making your bed, moving your body, and working on a personal goal — create momentum that builds throughout the day. These small, intentional choices compound over time, bringing real and lasting change.\n\nSuccess isn’t about doing everything perfectly or all at once — it’s about making steady progress. Now, my mornings are set with purpose, aligning with the future I’m working toward — not just the present version of me.\n\nAnd I’ve learned: How you set your day up is how it ends up.",
  "scraped_at": "2025-04-07 08:22:39"
}