{
  "title": "Are You Emotionally Healthy?",
  "url": "https://medium.com/@kenji-onisuka/are-you-emotionally-healthy-70c24242dd69",
  "author": "Kenji",
  "publish_date": "Feb 4, 2025",
  "read_time": "2 min read",
  "claps": 35,
  "comments": 1,
  "content": "Member-only story\n\nAre You Emotionally Healthy?\n\n5 Brutal Signs You Are (Or Aren’t)\n\nKenji\n\n35\n\n1\n\nM\nost people think being “emotionally healthy” means feeling good all the time. Wrong.\n\nIt means you’re in control — even when things suck.\n\nCheck these five. If you’re missing one, fix it.\n\n1. You Listen to Your Body.\n\nYour body talks. Most people don’t listen.\n\nFatigue? Ignored.\nStress? Covered up with caffeine.\nPain? Pushed through until it turns into a problem.\n\nEmotionally healthy people don’t wait until they crash. They fix the problem before it wrecks them. You wouldn’t drive a car with the check engine light on forever — so why treat your body like that?\n\n2. You See What’s Wrong With You — And You Own It.\n\nEveryone has flaws. Most people defend theirs.\n\nNot emotionally healthy people.\n\nThey call themselves out. They fix their problems before life forces them to. You'll stay weak if you can’t admit where you’re weak. If you refuse to change, you’ll stay stuck.\n\nTough truth: If something about your life sucks, it’s probably your fault.\n\n3. You Cut Off Toxic People — Fast.\n\nA bad relationship is a weight around your neck.\n\nMost people keep people around because they “feel bad” cutting them off. Know what feels worse? Years of wasted time, energy, and mental space.\n\nEmotionally healthy people don’t tolerate people who drain them. They cut the cord before it’s too late. If you wouldn’t choose them as a friend today, why are they still in your life?\n\n4. You Can Be Alone Without Losing Your Mind.\n\nMost people need noise, distraction, or validation to feel okay. That’s a red flag.\n\nIf you can’t sit in a room alone without reaching for your phone, you’re not okay with yourself.\n\nEmotionally healthy people use solitude to get better. They reflect. They think. They reset. If you always need someone or something to distract you, fix that first.\n\n5. You Don’t Waste Time Complaining — You Find the Lesson.\n\nLife isn’t fair. Bad things happen. Good things happen.\n\nEmotionally healthy people don’t waste time whining. They ask: What can I learn? How do I use this? How does this make me better?\n\nWeak people get stuck in their failures. Strong people turn their failures into fuel.\n\nMy Thought:\n\nMost people let life happen to them. Emotionally healthy people TAKE CONTROL.\n\nThey don’t make decisions based on comfort. They do what’s necessary — even when it’s hard.\n\nIf you don’t check all five boxes, you have work to do.\n\nAnd life doesn’t wait.",
  "scraped_at": "2025-04-07 08:17:18"
}