{
  "title": "Tariffs Are a Tax on the Future",
  "url": "https://medium.com/@kenji-onisuka/tariffs-are-a-tax-on-the-future-beb957388c5e",
  "author": "Kenji",
  "publish_date": null,
  "read_time": "3 min read",
  "claps": 0,
  "comments": 0,
  "content": "Member-only story\n\nTariffs Are a Tax on the Future\n\nWhy the U.S. Is Betting Against Global Prosperity\n\nKenji\n\nI\nmagine a world where your local grocery store suddenly charges you double for oranges — just because they came from the neighboring town. Not because the quality changed, not because of a shortage, just because.\n\nNow scale that decision across thousands of products and billions in trade, and you understand the strange logic behind modern tariffs.\n\nThe United States has chosen this path again, raising tariffs dramatically on a wide range of goods. This is being framed as fairness. In reality, it’s friction—unnecessary, self-inflicted, and expensive.\n\nLet’s be clear: tariffs are not just taxes on foreign countries. They are taxes on your consumption, your supply chain, your future.\n\nThe Hidden Cost of Protectionism\n\nThe popular defense of tariffs is simple: “They protect local jobs.”\n\nThat’s appealing, especially when people feel their economies are vulnerable. But the evidence tells a different story.\n\nTariffs raise prices. They slow down trade. They disrupt investment. And in the end, they often hurt the very workers they’re supposed to protect.\n\nIn this case, the new U.S. tariffs are deeply uneven, below are some of the examples.\n\nYou can also find the table of “reciprocal tariffs” displayed at Trump’s announcement here:\n\nTrump's tariffs: the full list\n\nUS president Donald Trump yesterday produced a chart of all the new tariffs he was announcing, affecting trade with…\n\nwww.theguardian.com\n\nWhy are these numbers so different? No one really knows. The data used to justify them is, at best, questionable. South Korea and Malaysia were accused of applying 50% tariffs on U.S. goods — but trade records don’t support that.\n\nTariffs Don’t Solve Global Problems\n\nThe world economy isn’t a boxing ring where one side wins and the other loses. It’s a network — interconnected, interdependent, and built on cooperation. When tariffs go up in one country, costs ripple outward. Investment freezes. Prices rise. Innovation slows.\n\nAsia-Pacific economies are particularly exposed. These are manufacturing-driven countries, deeply embedded in supply chains that stretch from factory floors in Vietnam to ports in California. When the U.S. imposes tariffs, these systems don’t just bend — they break.\n\nAnd the damage doesn’t stop there:\n\nLessons from History\n\nWe’ve seen this movie before. The 1930 Smoot-Hawley Tariff Act worsened the Great Depression. Trade shrank, countries retaliated, and cooperation fell apart.\n\nSmoot-Hawley Tariff Act - Wikipedia\n\nNicknames Hawley-Smoot Tariff, Smoot-Hawley Tariff Enacted by the 71st United States Congress Public law Pub. L. 71-361…\n\nen.wikipedia.org\n\nToday, we face different challenges—climate change, technological disruption, and geopolitical instability. Tariffs cannot fix these problems. In fact, they make cooperation harder.\n\nWhen the U.S. sends the message that every trading partner is a threat, it creates a world where every country arms itself with trade barriers.\n\nNo one wins in that scenario — not even the strongest economies.\n\nA Smarter Way Forward\n\nWe do have legitimate trade concerns.\n\nBut those should be handled through modern tools: negotiated agreements, transparent enforcement, shared standards.\n\nTariffs are a 19th-century solution to a 21st-century economy.\n\nIf we care about competitiveness, resilience, and long-term prosperity, the answer isn’t retreat — it’s reform.\n\nThe real risk of these tariffs isn’t that they will destroy trade overnight. It’s that they will quietly erode the foundation of global cooperation we’ve spent decades building.\n\nTrade is not just about goods. It’s about trust.\n\nAnd once that’s broken, no tariff can bring it back.\n\n#Economy #Tariff\n\nLet’s be clear: tariffs are not just taxes on foreign countries. They are taxes on your consumption, your supply chain, your future.",
  "scraped_at": "2025-04-07 08:28:12"
}