{
  "title": "Sora Leaked: What Happened?",
  "url": "https://medium.com/ai-unscripted/sora-leaked-what-happened-7bbebe576830",
  "author": "Kenji",
  "publish_date": "Nov 28, 2024",
  "read_time": "2 min read",
  "claps": 29,
  "comments": 0,
  "cover_image_url": "https://miro.medium.com/v2/resize:fit:700/1*G6VcWM6fXyc9C40JcGW6jQ@2x.jpeg",
  "content": "Member-only story\n\nSora Leaked: What Happened?\n\nKenji\n\nAI Unscripted\n\n29\n\nWhere would OpenAI be without controversy?\n\nOpenAI is making waves again, and not in a good way. Its highly anticipated text-to-video model, Sora, faced an unexpected leak after being shared with a group of artists for testing. The goal was to refine the model through feedback and collaboration. Instead, it ended in backlash and public drama.\n\nSora: A Game-Changer or a Problem?\n\nSora is OpenAI’s text-to-video AI model, capable of transforming text prompts into stunningly realistic videos. From flowing animations to consistent movement and physics, Sora is a leap forward in creative technology.\n\nBut the rollout hasn’t been smooth. Invited artists saw their involvement not as collaboration but as unpaid labor, fueling frustrations that led to the leak.\n\nThe Leak: Why Did Artists Take a Stand?\n\nThe leak, hosted on Hugging Face, PR-Puppet-Sora, included API access, videos showcasing Sora’s abilities, and a manifesto-style letter criticizing OpenAI. The artists listed several reasons for exposing the model:\n\nThe letter reflects deep frustration with the lack of transparency and compensation in the rollout. Here is the screenshot from the letter.\n\nFallout: Trust Broken, Questions Raised\n\nThe leak has sparked heated debates about the ethical responsibilities of AI companies. Artists argued they aren’t free testers or marketing tools, and the backlash has shone a light on the ongoing tension between tech and creative communities. OpenAI’s attempt to contain the leak — revoking access and silencing discussions in its forums — has only deepened concerns.\n\nWhat’s Next for OpenAI?\n\nTo recover from this misstep, OpenAI needs to rethink how it engages with creators. Offering fair compensation, fostering transparency, and involving artists as true collaborators — not unpaid contributors — are essential. Without these changes, OpenAI risks alienating the very people it claims to support.\n\nSora is undeniably impressive, but innovation means little without trust. The question is whether OpenAI will listen.",
  "scraped_at": "2025-04-07 09:25:50"
}