{
  "title": "US Post-Election 2024: A Turning Point for Technology and Innovation",
  "url": "https://medium.com/ai-unscripted/us-post-election-2024-a-turning-point-for-technology-and-innovation-47706beef3e1",
  "author": "Kenji",
  "publish_date": "Nov 9, 2024",
  "read_time": "3 min read",
  "claps": 80,
  "comments": 0,
  "cover_image_url": "https://miro.medium.com/v2/resize:fit:661/1*fvFml8Mn7K3j3Z8LbYrfmg.png",
  "content": "Member-only story\n\nUS Post-Election 2024: A Turning Point for Technology and Innovation\n\nHow AI, crypto, and social media may thrive\n\nKenji\n\nAI Unscripted\n\n80\n\nT\nrump and the Republican Party chalked up significant wins this week, reshaping the political and economic landscape. Writing this wasn’t an easy decision, given how polarizing figures like the incoming administration and Elon Musk can be.\n\nAs an outsider and non-citizen, I wasn’t eligible to vote in the election, but my interest lies in observing its implications for technology. This article focuses on what matters most to me: the potential impact on the tech space, from artificial intelligence and cryptocurrency to platforms like TikTok.\n\nLet’s leave politics at the door and explore what these changes could mean for innovation and growth.\n\nA New Era of Growth and Deregulation?\n\nThe U.S. tech sector could see a transformative period under Trump’s administration. With antitrust pressures easing, tech companies like Apple, Google, and others may be able to prioritize innovation over legal battles.\n\nThis deregulated environment also promises to accelerate advancements in artificial intelligence (AI), an area Trump has highlighted as critical to maintaining U.S. dominance over global competitors like China.\n\nAI as a Strategic Focus\n\nThe U.S. is poised to prioritize AI development to maintain its global leadership. Key areas of focus are efforts to bolster chip production, expand data center infrastructure, and support open-source AI projects. Export controls are also expected to tighten, limiting China’s access to cutting-edge technologies and ensuring a competitive edge.\n\nWhile debates continue over the balance between innovation and national security, a push for deregulation could accelerate AI adoption across industries like defense, healthcare, and transportation, fostering faster growth and broader integration.\n\nCryptocurrency: A Path to Legitimacy?\n\nThe incoming administration is poised to elevate cryptocurrency, emphasizing “Made in America” bitcoin mining and creating a pro-crypto advisory council to influence policymaking.\n\nBitcoin has hit record highs while institutional interest continues to grow. Companies like Coinbase and MicroStrategy enjoy notable gains, reflecting wider acceptance of digital assets.\n\nWith a friendlier regulatory environment, potential Federal Reserve rate cuts, and clearer policies, the sector could see broader adoption and significant institutional investment.\n\nStill, environmental concerns and skepticism from traditional financial systems remain significant hurdles.\n\nTikTok: Will the Ban Be Enforced in January 2025?\n\nTikTok faces a January 19 deadline to divest from its China-based parent company, ByteDance, or be banned from U.S. app stores under a law signed by President Biden.\n\nThe incoming administration, however, offers a glimmer of hope for the platform. Public opposition to banning TikTok suggests penalties against app stores hosting the app might not be enforced.\n\nIf the ban is enforced before inauguration, the administration could repeal it with congressional support or delay penalties amid ongoing legal challenges.\n\nFor now, TikTok may continue operating, offering creators and businesses the stability they’ve sought after years of uncertainty.\n\nLooking Forward\n\nPredicting what will happen in politics is hard — it changes even faster than the tech industry. However, the environment appears to be tech-friendly in the short term, with opportunities for AI, cryptocurrency, and platforms like TikTok to thrive.\n\nThe incoming administration seeks to position the U.S. as a leader in technological advancement by focusing on deregulation, strategic competition, and policies that encourage innovation. Whether these changes are viewed positively or negatively is a discussion for another time",
  "scraped_at": "2025-04-07 09:26:52"
}