{
  "title": "The Key to Mental Strength in a Digital Age",
  "url": "https://medium.com/@kenji-onisuka/the-key-to-mental-strength-in-a-digital-age-86f1f50808bb",
  "author": "Kenji",
  "publish_date": "Jul 8, 2024",
  "read_time": "6 min read",
  "claps": 0,
  "comments": 0,
  "cover_image_url": "https://miro.medium.com/v2/resize:fit:700/1*SvohJQDLeGqoLAu0PmQp0A.png",
  "content": "The Key to Mental Strength in a Digital Age\n\nKenji\n\nIn his timeless poem “If — ,” Rudyard Kipling writes, “If you can keep your head when all about you / Are losing theirs and blaming it on you…” These words ring especially true in the digital age, where constant stimuli and pressure to maintain a perfect online presence can challenge even the most resilient. Kipling’s wisdom serves as a powerful reminder of the enduring importance of emotional control and mental strength, qualities that are increasingly vital as we navigate the complexities of the modern world. These themes are echoed in a recent thought-provoking episode of the “Modern Wisdom” podcast, which discussed the topic of emotional control and mental strength, offering insights that align with Kipling’s wisdom and provide practical strategies for navigating the emotional landscape of the digital age.\n\nPersonal Note: I want to clarify that I am not a trained psychologist, mental health professional, or expert in emotional well-being. My insights stem from personal experiences and an in-depth exploration of relevant literature and podcasts, including the impactful discussions in “Modern Wisdom.” This article reflects my personal journey of understanding, which I am sharing with you. Writing about these topics helps me grasp them more deeply than just reading or listening, enhancing my understanding and engagement with the material. Any interpretations and errors in this piece are my own.\n\nFacing Reality — The Choice Between Growth and Stagnation:\n\nIn the face of difficult emotions, we are often confronted with a choice: to confront reality head-on or to numb ourselves to discomfort. This decision mirrors the “red pill” and “blue pill” analogy from “The Matrix,” — which, I might add, is one of the best movies ever. In this analogy, the red pill symbolizes the pursuit of truth and growth, while the blue pill represents blissful ignorance. Opting for the red pill and choosing to face our struggles directly may initially increase discomfort, but it is the only path to genuine transformation. Rudyard Kipling’s lines from “If — “, “If you can trust yourself when all men doubt you, / But make allowance for their doubting too,” underscore the importance of maintaining self-trust and resilience in the face of external criticism and doubt — challenges that are all too common in the digital world.\n\nThe Perils of Emotional Avoidance: In today’s digital landscape, it’s incredibly easy to sidestep uncomfortable emotions by immersing ourselves in social media, video games, or other digital distractions. While these platforms may offer a temporary escape, using them to numb negative emotions can significantly impede our ability to process and learn from challenging experiences. Persistent avoidance of discomfort not only risks stagnation but can also lead to more severe mental health issues. To foster genuine personal growth, we must embrace our emotions, acknowledging their presence and delving into the valuable insights they provide.\n\nTuning In — The Mind-Body Connection: A crucial aspect of mastering our emotions is recognizing the intimate connection between our mental states and physical sensations. Emotions manifest not only in our minds but also physically in our bodies — this might be a tightness in the chest, a knot in the stomach, or a racing heartbeat. We can better understand and regulate our emotional states by developing an awareness of these physical cues. This connection is deeply rooted in the autonomic nervous system, which governs our physiological responses to stress. To enhance this awareness, consider practicing mindfulness exercises such as body scans. These involve systematically focusing on different parts of your body, noting any sensations or tension without judgment, and gently fostering a deeper connection to your physical responses.\n\nStaying True — Overcoming Comparison and Cultivating Self-Compassion\n\nIn an age where social media bombards us with curated highlight reels of others’ lives, it’s easy to fall into the trap of comparison and self-doubt. Focusing on our own unique journey and celebrating personal wins, no matter how small, can help build self-confidence and maintain motivation. As Kipling advises, “If you can meet with Triumph and Disaster / And treat those two impostors just the same,” reminding us to stay grounded and true to ourselves regardless of external validation or success.\n\nCultivating self-compassion is another crucial aspect of emotional resilience. By treating ourselves with kindness and understanding, particularly in the face of setbacks, we can better navigate life’s challenges and maintain a stable sense of self. To practice self-compassion, try incorporating daily affirmations or gratitude exercises into your routine, focusing on your intrinsic worth rather than external achievements. Remember Kipling’s words: “If you can force your heart and nerve and sinew / To serve your turn long after they are gone,” highlighting the importance of self-care and perseverance in the face of adversity.\n\nEmbracing Discomfort — The Path to Growth\n\nUltimately, genuine growth and transformation require embracing discomfort. By choosing to face our struggles head-on, we develop greater self-awareness, resilience, and adaptability. As Kipling writes, “If you can fill the unforgiving minute / With sixty seconds’ worth of distance run,” suggesting that by fully engaging with each moment and challenge, we can achieve a sense of mastery and fulfillment that extends far beyond the fleeting highs of success or the temporary lows of failure.\n\nConclusion: Mastering Your Emotions, Mastering Your Life\n\nRudyard Kipling’s “If — “ and the insights from the “Modern Wisdom” podcast offer wisdom on mastering our emotions and building mental strength, qualities that are more important than ever in the digital age. By choosing to face reality, tune into our mind-body connection, stay true to ourselves, and embrace discomfort as a catalyst for growth, we can develop the resilience and adaptability needed to thrive in the modern world.\n\nAs we reflect on these themes, Kipling’s poem serves as an inspiration and a guide. The full text of “If — “ is presented below, providing us with a poetic blueprint for personal development and emotional resilience. May these words inspire you as much as they have inspired this article.\n\nFull Text of “If — “ by Rudyard Kipling\n\nIf you can keep your head when all about you\nAre losing theirs and blaming it on you,\nIf you can trust yourself when all men doubt you,\nBut make allowance for their doubting too;\nIf you can wait and not be tired by waiting,\nOr being lied about, don’t deal in lies,\nOr being hated, don’t give way to hating,\nAnd yet don’t look too good, nor talk too wise:\nIf you can dream — and not make dreams your master;\nIf you can think — and not make thoughts your aim;\nIf you can meet with Triumph and Disaster\nAnd treat those two impostors just the same;\nIf you can bear to hear the truth you’ve spoken\nTwisted by knaves to make a trap for fools,\nOr watch the things you gave your life to, broken,\nAnd stoop and build ’em up with worn-out tools:\nIf you can make one heap of all your winnings\nAnd risk it on one turn of pitch-and-toss,\nAnd lose, and start again at your beginnings\nAnd never breathe a word about your loss;\nIf you can force your heart and nerve and sinew\nTo serve your turn long after they are gone,\nAnd so hold on when there is nothing in you\nExcept the Will which says to them: ‘Hold on!’\nIf you can talk with crowds and keep your virtue,\nOr walk with Kings — nor lose the common touch,\nIf neither foes nor loving friends can hurt you,\nIf all men count with you, but none too much;\nIf you can fill the unforgiving minute\nWith sixty seconds’ worth of distance run,\nYours is the Earth and everything that’s in it,\nAnd — which is more — you’ll be a Man, my son!\n\nIf you can keep your head when all about you\n\nAre losing theirs and blaming it on you,\n\nIf you can trust yourself when all men doubt you,\n\nBut make allowance for their doubting too;\n\nIf you can wait and not be tired by waiting,\n\nOr being lied about, don’t deal in lies,\n\nOr being hated, don’t give way to hating,\n\nAnd yet don’t look too good, nor talk too wise:\n\nIf you can dream — and not make dreams your master;\n\nIf you can think — and not make thoughts your aim;\n\nIf you can meet with Triumph and Disaster\n\nAnd treat those two impostors just the same;\n\nIf you can bear to hear the truth you’ve spoken\n\nTwisted by knaves to make a trap for fools,\n\nOr watch the things you gave your life to, broken,\n\nAnd stoop and build ’em up with worn-out tools:\n\nIf you can make one heap of all your winnings\n\nAnd risk it on one turn of pitch-and-toss,\n\nAnd lose, and start again at your beginnings\n\nAnd never breathe a word about your loss;\n\nIf you can force your heart and nerve and sinew\n\nTo serve your turn long after they are gone,\n\nAnd so hold on when there is nothing in you\n\nExcept the Will which says to them: ‘Hold on!’\n\nIf you can talk with crowds and keep your virtue,\n\nOr walk with Kings — nor lose the common touch,\n\nIf neither foes nor loving friends can hurt you,\n\nIf all men count with you, but none too much;\n\nIf you can fill the unforgiving minute\n\nWith sixty seconds’ worth of distance run,\n\nYours is the Earth and everything that’s in it,\n\nAnd — which is more — you’ll be a Man, my son!\n\nReference:\n\n1. Clark, Malissa. Never Not Working: Why the Always-On Culture Is Bad for Business — and How to Fix It. Published February 6, 2024.\n\n2. Kipling, Rudyard. “If — “, first published in 1910. Full text available in the public domain or in collections such as “Rudyard Kipling’s Verse: Definitive Edition.” Often accessible online through various educational and literary websites.\n\n3. Modern Wisdom Podcast — Episode: “How to control your emotion and become mentally strong.” Available at: https://chriswillx.com/how-to-control-your-emotion-and-become-mentally-strong/.",
  "scraped_at": "2025-04-07 09:16:58"
}