{
  "title": "Focus on the Present: My New Year’s Resolution",
  "url": "https://medium.com/@kenji-onisuka/focus-on-the-present-my-new-years-resolution-2e55f1597fab",
  "author": "Kenji",
  "publish_date": "Jan 2, 2025",
  "read_time": "2 min read",
  "claps": 72,
  "comments": 0,
  "cover_image_url": "https://miro.medium.com/v2/resize:fit:700/0*Se5pL2p0QlD4WANu",
  "content": "Member-only story\n\nFocus on the Present: My New Year’s Resolution\n\nKenji\n\n72\n\nThe biggest risk to your future isn’t your competition. It’s the distractions you insist on keeping in your life. Rather than doing the things you know you should be doing but aren’t.\n\nThe biggest risk to your future isn’t your competition. It’s the distractions you insist on keeping in your life. Rather than doing the things you know you should be doing but aren’t.\n\nAlex Hormozi on LinkedIn: The biggest risk to your future isn't your competition. It's the... | 787…\n\nThe biggest risk to your future isn't your competition. It's the distractions you insist on keeping in your life…\n\nwww.linkedin.com\n\nT\nhis quote from Alex Hormozi struck a chord with me in 2024. I wrote it down in my notebook as a reminder, and it has since become my guide. It’s about stripping away the noise, eliminating distractions, and doing the work that matters — whether for your career, relationships, or personal growth.\n\nBut focusing on the present isn’t always easy. I’ve realized that much of my struggle comes from avoiding discomfort. I sometimes overanalyze, hoping to control every aspect of the future, only to find myself paralyzed by fear of the unknown.\n\nWe live in a world that subtly teaches us to treat today as a stepping stone for a “better tomorrow.” The problem with that mindset is that you start waiting for life to begin, assuming happiness and fulfillment lie somewhere in the future.\n\nThat illusion of a perfect “happily ever after” often leaves us stuck, fearful of moving forward or sliding back. Yet, life isn’t linear — it’s messy. There are ups and downs, grey areas, and days that feel endless and fleeting. But within this chaos lies the opportunity to embrace the now. Because, as uncomfortable as it might be, this moment is all we truly have.\n\nHappiness isn’t a grand destination; it’s woven into the small, imperfect moments we often overlook. It’s the experience of sipping that morning coffee, laughing at a joke, or feeling the satisfaction of checking a task off your list. It’s about choosing to act rather than waiting for conditions to be perfect.\n\nSo, as we step into 2025, my resolution is simple yet profound: focus on the present.\n\nSo, as we step into 2025, my resolution is simple yet profound: focus on the present.\n\nRoll up my sleeves, embrace the discomfort, and make every moment count. Not by chasing perfection but by being present in the mess and beauty of today. Because when all is said and done, our actions now — not our past or imagined future — define who we are.",
  "scraped_at": "2025-04-07 09:06:28"
}