{
  "title": "My Quest for Social Intelligence: 6 Things I’m Learning",
  "url": "https://medium.com/@kenji-onisuka/my-quest-for-social-intelligence-6-things-im-learning-014fe3123eb5",
  "author": "Kenji",
  "publish_date": "Jan 13, 2025",
  "read_time": "3 min read",
  "claps": 17,
  "comments": 1,
  "cover_image_url": "https://miro.medium.com/v2/resize:fit:700/0*qpgvxddoFJtioJfl",
  "content": "Member-only story\n\nMy Quest for Social Intelligence: 6 Things I’m Learning\n\nObservations and lessons learned\n\nKenji\n\n17\n\n1\n\nL\net me get this out of the way: I am not naturally socially intelligent. Meeting new people feels like standing in front of a brick wall and trying to converse.\n\nAfter a few polite exchanges, my brain stops. And sometimes — this is embarrassing — I listen, but I’m not hearing. I’m there but not present.\n\nThis isn’t how I want to live. I’ve been fortunate to work with people who are genuinely socially intelligent. They move through conversations effortlessly and leave everyone feeling better after interacting with them. Watching them taught me a lot.\n\nSo, here are 5+1 traits I’ve observed in socially intelligent people. The first five are things I’ve noticed in others. The +1? That’s something personal — something I’m working on every day.\n\n1. Pause Before Reacting\n\nSocially intelligent people don’t get defensive when criticized. They don’t jump to conclusions or fight back to protect their ego. They take their time to listen, reflect, and respond. Watching this made me realize how quick I’ve been to defend myself. The fastest response is rarely the best.\n\n2. They Separate the Person From the Action\n\nInstead of saying, “That person is lazy,” they’ll say, “I don’t think they were fully engaged in that moment.” This difference is subtle but powerful. They understand that one action doesn’t define someone’s entire character. This mindset gives them clarity and keeps them from carrying unnecessary resentment.\n\n3. They Avoid Pointless Arguments\n\nYou know those people who argue just to win? Socially intelligent people don’t bother with them. They know when someone is debating to learn versus just wanting to dominate. The moment they sense the latter, they check out. Their focus stays on meaningful conversations, not petty squabbles.\n\n4. They Focus on the Problem, Not the Person\n\nWhen someone says something flawed, socially intelligent people don’t attack the person’s character. They focus on the substance of what’s being said. For example, if someone who is frequently late says, “It’s important to be punctual,” they don’t respond with, “Well, that’s rich coming from you.” They address the importance of punctuality, not the person’s past behavior.\n\n5. They Speak Clearly and Directly\n\nSocially intelligent people are precise with their words. They don’t beat around the bush or drown their message in fluff. When they say something, you get it. Clear, direct, and simple. It’s a trait I deeply admire and something I’m working on because, honestly, I tend to overthink and ramble.\n\n+1: They Work on Themselves First\n\nThis one is personal for me. The most socially intelligent people I’ve met are deeply self-aware. They understand that how they treat others mirrors how they treat themselves. They prioritize self-improvement. Writing this article is part of my effort to work on myself. Because if I don’t do the inner work, the outer results won’t follow.\n\nA Parting Thought\n\nThis isn’t about being perfect; it’s about being intentional. If you want to improve how you connect with others, I truly believe the first step is to start with yourself.\n\nThe more you understand and work on your own patterns, the better you’ll show up in your interactions with others. Growth takes time, but it’s always worth the effort.",
  "scraped_at": "2025-04-07 09:12:10"
}